import itertools

job_sub = ["公務員","和尚", "會長", "市長","市長", "班長", "家長","校長","院長", "法官", "海軍", "尼姑", "護士", "警察", "郵差", "總統", "妓女", 
           "佣人", "小偷", "他們", "獸醫", "侍者"]

human_subjects = ["我", "公公", "岳母", "姑丈", "嬸嬸", "姨丈", "舅媽", "大嫂", "女婿", "姊夫", "原住民", "孫女", "祖父", "奶奶",
            "外甥", "姪子", "外甥女", "弟弟", "妹妹", "太太", "我們", "我倆", "他倆", "老師", "哥哥", "女兒", "父親", "農夫",
            "伯父", "姑姑", "叔叔", "丈夫", "印第安人", "母親", "舅舅","阿姨", "姊姊"]

animal_subjects = ["貓", "狗", "馬", "牛", "羊", "豬", "雞", "鴨","動物", "熊", "蜜蜂", "蒼蠅","長頸鹿", "鵝", "獅子", "猴子", "猩猩","孔雀",
                   "青蛙", "壁虎", "兔子", "蝸牛", "蛇", "蜘蛛", "老虎", "老鼠"]

obj = ["她", "他", "牠", "它", "這個", "那個", "這隻", "那隻", "這些", "那些", "這種", "那種", "我"]

skills = ["游泳", "自由式", "蛙式", "仰式", "冒險", "佈置", "刨木頭", "雕刻", "砍樹", "跳舞", "跳水", "開車", "刺繡", "釣魚", "飛", "削水果"
          "按摩", "爬山", "乘法", "投球", "打牌", "接力賽跑", "划船", "翻跟斗", "打掃", "掃地"]

adj = ["狡猾", "聰明", "軟", "柔軟", "孤獨", "暖和"]

clothes = ["裙子", "拖鞋","皮鞋"]

plant = ["馬鈴薯", ]

verb = ["捲","划", "跑" , "探索", "唱", "沉","坐", "打盹", "溜滑梯", "折斷", "解決", "說", "說話", "打開", "貼", "黏", "攪", "炒", "部屬", "代替"
        "提出", "建議", "取", "照顧", "扔掉", "接觸", "吐", "洗臉", "洗髮", "擰", "寫", "吞嚥","烤"]

color= ["粉紅色"]

food = ["醬油", "豆漿", "壽司","飯糰","燒餅","燒餅油條","羹","起司","牛奶","果汁","紅茶","綠茶","珍珠奶茶","開水","可口可樂","百事可樂","椰子","柚子","奇異果","自助餐","夜市","牛排","義大利麵","便當","碗粿","刀削麵","甜不辣","布丁","豆花"
        ,"果凍","蚵仔煎","貢丸","花枝丸","素丸","魚丸","蝦丸","蝦捲","小籠包","火雞肉飯","大腸包小腸","米腸","香腸","棺材板","太陽餅","薑母鴨","麻糬","米苔目","擔仔麵","蛋捲","鳳梨酥","萬巒豬腳", "菠菜","米漿","榴槤","拉麵","鍋貼""蔥抓餅","豬血糕","蘿蔔糕","紅豆餅","米糕","豬腳麵線","海鮮"]

nation = ["以色列", "義大利", "日本", "中國大陸", "馬來西亞", "西班牙", "瑞士", "台灣"]

district = ["高雄", "基隆", "苗栗", "紐約", "大阪", "巴黎", "三重", "台南", "台北", "淡水", "泰山"
            ,"中壢"]

place = ["山", "北極", "北美洲", "公園", "學校", "7-11", "南美洲", "南極", "每週","全家便利商店", "OK便利商店", "好市多""百貨公司","菜市場","書局","購物中心","停車場","文化中心","美容院","旅館", "運動場","操場","高爾夫球場", "孔廟","學務處"]

rank = ["第二名", ]
        
edu_lv = ["高中", "高職", "科技大學"]

school = ["師大"]

festival = ["中秋節", "元旦", "除夕","清明節"]

time = ["星期一", "每個月", "清晨", "早上", "下兩星期", "下個星期","明年", "一點鐘","一天", "一個鐘頭", "一小時","一分鐘","一個月","一秒鐘","一個星期",
        "星期六", "下學期", "一年級下學期", "一瞬間", "星期天", "星期四","星期二", "上兩星期", "昨天" ]

template = "{subj}會{skill}"
output = []

for subj, skill in itertools.product(subjects, skills):
    sentence = template.format(subj=subj, skill=skill)
    segmented = f"{subj}/{skill}/會"
    output.append((sentence, segmented))

# 輸出結果
for original, segmented in output:
    print(f'"{original}","{segmented}"')
